espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_dwt.h
/******************************************************************************
*  Filename:       hw_cpu_dwt_h
*  Revised:        $Date$
*  Revision:       $Revision$
*
* Copyright (c) 2015 - 2017, Texas Instruments Incorporated
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1) Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
*
* 2) Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
* 3) Neither the name of the ORGANIZATION nor the names of its contributors may
*    be used to endorse or promote products derived from this software without
*    specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_CPU_DWT_H__
#define __HW_CPU_DWT_H__

//*****************************************************************************
//
// This section defines the register offsets of
// CPU_DWT component
//
//*****************************************************************************
// Provides configuration and status information for the DWT unit, and used to
// control features of the unit
#define CPU_DWT_O_CTRL                                              0x00000000

// Shows or sets the value of the processor cycle counter, CYCCNT
#define CPU_DWT_O_CYCCNT                                            0x00000004

// CPI Count Register
#define CPU_DWT_O_CPICNT                                            0x00000008

// Counts the total cycles spent in exception processing
#define CPU_DWT_O_EXCCNT                                            0x0000000C

// Sleep Count Register
#define CPU_DWT_O_SLEEPCNT                                          0x00000010

// Increments on the additional cycles required to execute all load or store
// instructions
#define CPU_DWT_O_LSUCNT                                            0x00000014

// Increments on the additional cycles required to execute all load or store
// instructions
#define CPU_DWT_O_FOLDCNT                                           0x00000018

// Program Counter Sample Register
#define CPU_DWT_O_PCSR                                              0x0000001C

// Provides a reference value for use by watchpoint comparator 0
#define CPU_DWT_O_COMP0                                             0x00000020

// Controls the operation of watchpoint comparator 0
#define CPU_DWT_O_FUNCTION0                                         0x00000028

// Provides a reference value for use by watchpoint comparator 1
#define CPU_DWT_O_COMP1                                             0x00000030

// Controls the operation of watchpoint comparator 1
#define CPU_DWT_O_FUNCTION1                                         0x00000038

// Provides a reference value for use by watchpoint comparator 2
#define CPU_DWT_O_COMP2                                             0x00000040

// Controls the operation of watchpoint comparator 2
#define CPU_DWT_O_FUNCTION2                                         0x00000048

// Provides a reference value for use by watchpoint comparator 3
#define CPU_DWT_O_COMP3                                             0x00000050

// Controls the operation of watchpoint comparator 3
#define CPU_DWT_O_FUNCTION3                                         0x00000058

// Provides CoreSight discovery information for the DWT
#define CPU_DWT_O_DEVARCH                                           0x00000FBC

// Provides CoreSight discovery information for the DWT
#define CPU_DWT_O_DEVTYPE                                           0x00000FCC

// Provides CoreSight discovery information for the DWT
#define CPU_DWT_O_PIDR4                                             0x00000FD0

// Provides CoreSight discovery information for the DWT
#define CPU_DWT_O_PIDR5                                             0x00000FD4

// Provides CoreSight discovery information for the DWT
#define CPU_DWT_O_PIDR6                                             0x00000FD8

// Provides CoreSight discovery information for the DWT
#define CPU_DWT_O_PIDR7                                             0x00000FDC

// Provides CoreSight discovery information for the DWT
#define CPU_DWT_O_PIDR0                                             0x00000FE0

// Provides CoreSight discovery information for the DWT
#define CPU_DWT_O_PIDR1                                             0x00000FE4

// Provides CoreSight discovery information for the DWT
#define CPU_DWT_O_PIDR2                                             0x00000FE8

// Provides CoreSight discovery information for the DWT
#define CPU_DWT_O_PIDR3                                             0x00000FEC

// Provides CoreSight discovery information for the DWT
#define CPU_DWT_O_CIDR0                                             0x00000FF0

// Provides CoreSight discovery information for the DWT
#define CPU_DWT_O_CIDR1                                             0x00000FF4

// Provides CoreSight discovery information for the DWT
#define CPU_DWT_O_CIDR2                                             0x00000FF8

// Provides CoreSight discovery information for the DWT
#define CPU_DWT_O_CIDR3                                             0x00000FFC

//*****************************************************************************
//
// Register: CPU_DWT_O_CTRL
//
//*****************************************************************************
// Field: [31:28] NUMCOMP
//
// Number of DWT comparators implemented
#define CPU_DWT_CTRL_NUMCOMP_W                                               4
#define CPU_DWT_CTRL_NUMCOMP_M                                      0xF0000000
#define CPU_DWT_CTRL_NUMCOMP_S                                              28

