espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_dwt.h
// Field:    [27] NOTRCPKT
//
// Indicates whether the implementation does not support trace
#define CPU_DWT_CTRL_NOTRCPKT                                       0x08000000
#define CPU_DWT_CTRL_NOTRCPKT_BITN                                          27
#define CPU_DWT_CTRL_NOTRCPKT_M                                     0x08000000
#define CPU_DWT_CTRL_NOTRCPKT_S                                             27

// Field:    [26] NOEXTTRIG
//
// Reserved, RAZ
#define CPU_DWT_CTRL_NOEXTTRIG                                      0x04000000
#define CPU_DWT_CTRL_NOEXTTRIG_BITN                                         26
#define CPU_DWT_CTRL_NOEXTTRIG_M                                    0x04000000
#define CPU_DWT_CTRL_NOEXTTRIG_S                                            26

// Field:    [25] NOCYCCNT
//
// Indicates whether the implementation does not include a cycle counter
#define CPU_DWT_CTRL_NOCYCCNT                                       0x02000000
#define CPU_DWT_CTRL_NOCYCCNT_BITN                                          25
#define CPU_DWT_CTRL_NOCYCCNT_M                                     0x02000000
#define CPU_DWT_CTRL_NOCYCCNT_S                                             25

// Field:    [24] NOPRFCNT
//
// Indicates whether the implementation does not include the profiling counters
#define CPU_DWT_CTRL_NOPRFCNT                                       0x01000000
#define CPU_DWT_CTRL_NOPRFCNT_BITN                                          24
#define CPU_DWT_CTRL_NOPRFCNT_M                                     0x01000000
#define CPU_DWT_CTRL_NOPRFCNT_S                                             24

// Field:    [23] CYCDISS
//
// Controls whether the cycle counter is disabled in Secure state
#define CPU_DWT_CTRL_CYCDISS                                        0x00800000
#define CPU_DWT_CTRL_CYCDISS_BITN                                           23
#define CPU_DWT_CTRL_CYCDISS_M                                      0x00800000
#define CPU_DWT_CTRL_CYCDISS_S                                              23

// Field:    [22] CYCEVTENA
//
// Enables Event Counter packet generation on POSTCNT underflow
#define CPU_DWT_CTRL_CYCEVTENA                                      0x00400000
#define CPU_DWT_CTRL_CYCEVTENA_BITN                                         22
#define CPU_DWT_CTRL_CYCEVTENA_M                                    0x00400000
#define CPU_DWT_CTRL_CYCEVTENA_S                                            22

// Field:    [21] FOLDEVTENA
//
// Enables DWT_FOLDCNT counter
#define CPU_DWT_CTRL_FOLDEVTENA                                     0x00200000
#define CPU_DWT_CTRL_FOLDEVTENA_BITN                                        21
#define CPU_DWT_CTRL_FOLDEVTENA_M                                   0x00200000
#define CPU_DWT_CTRL_FOLDEVTENA_S                                           21

// Field:    [20] LSUEVTENA
//
// Enables DWT_LSUCNT counter
#define CPU_DWT_CTRL_LSUEVTENA                                      0x00100000
#define CPU_DWT_CTRL_LSUEVTENA_BITN                                         20
#define CPU_DWT_CTRL_LSUEVTENA_M                                    0x00100000
#define CPU_DWT_CTRL_LSUEVTENA_S                                            20

// Field:    [19] SLEEPEVTENA
//
// Enable DWT_SLEEPCNT counter
#define CPU_DWT_CTRL_SLEEPEVTENA                                    0x00080000
#define CPU_DWT_CTRL_SLEEPEVTENA_BITN                                       19
#define CPU_DWT_CTRL_SLEEPEVTENA_M                                  0x00080000
#define CPU_DWT_CTRL_SLEEPEVTENA_S                                          19

// Field:    [18] EXCEVTENA
//
// Enables DWT_EXCCNT counter
#define CPU_DWT_CTRL_EXCEVTENA                                      0x00040000
#define CPU_DWT_CTRL_EXCEVTENA_BITN                                         18
#define CPU_DWT_CTRL_EXCEVTENA_M                                    0x00040000
#define CPU_DWT_CTRL_EXCEVTENA_S                                            18

// Field:    [17] CPIEVTENA
//
// Enables DWT_CPICNT counter
#define CPU_DWT_CTRL_CPIEVTENA                                      0x00020000
#define CPU_DWT_CTRL_CPIEVTENA_BITN                                         17
#define CPU_DWT_CTRL_CPIEVTENA_M                                    0x00020000
#define CPU_DWT_CTRL_CPIEVTENA_S                                            17

// Field:    [16] EXTTRCENA
//
// Enables generation of Exception Trace packets
#define CPU_DWT_CTRL_EXTTRCENA                                      0x00010000
#define CPU_DWT_CTRL_EXTTRCENA_BITN                                         16
#define CPU_DWT_CTRL_EXTTRCENA_M                                    0x00010000
#define CPU_DWT_CTRL_EXTTRCENA_S                                            16

// Field:    [12] PCSAMPLENA
//
// Enables use of POSTCNT counter as a timer for Periodic PC Sample packet
// generation
#define CPU_DWT_CTRL_PCSAMPLENA                                     0x00001000
#define CPU_DWT_CTRL_PCSAMPLENA_BITN                                        12
#define CPU_DWT_CTRL_PCSAMPLENA_M                                   0x00001000
#define CPU_DWT_CTRL_PCSAMPLENA_S                                           12

// Field: [11:10] SYNCTAP
//
// Selects the position of the synchronization packet counter tap on the CYCCNT
// counter. This determines the Synchronization packet rate
#define CPU_DWT_CTRL_SYNCTAP_W                                               2
#define CPU_DWT_CTRL_SYNCTAP_M                                      0x00000C00
#define CPU_DWT_CTRL_SYNCTAP_S                                              10

// Field:     [9] CYCTAP
//
// Selects the position of the POSTCNT tap on the CYCCNT counter
#define CPU_DWT_CTRL_CYCTAP                                         0x00000200
#define CPU_DWT_CTRL_CYCTAP_BITN                                             9
#define CPU_DWT_CTRL_CYCTAP_M                                       0x00000200
#define CPU_DWT_CTRL_CYCTAP_S                                                9

// Field:   [8:5] POSTINIT
//
// Initial value for the POSTCNT counter
#define CPU_DWT_CTRL_POSTINIT_W                                              4
#define CPU_DWT_CTRL_POSTINIT_M                                     0x000001E0
#define CPU_DWT_CTRL_POSTINIT_S                                              5

