espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_dwt.h
// Field:   [4:1] POSTPRESET
//
// Reload value for the POSTCNT counter
#define CPU_DWT_CTRL_POSTPRESET_W                                            4
#define CPU_DWT_CTRL_POSTPRESET_M                                   0x0000001E
#define CPU_DWT_CTRL_POSTPRESET_S                                            1

// Field:     [0] CYCCNTENA
//
// Enables CYCCNT
#define CPU_DWT_CTRL_CYCCNTENA                                      0x00000001
#define CPU_DWT_CTRL_CYCCNTENA_BITN                                          0
#define CPU_DWT_CTRL_CYCCNTENA_M                                    0x00000001
#define CPU_DWT_CTRL_CYCCNTENA_S                                             0

//*****************************************************************************
//
// Register: CPU_DWT_O_CYCCNT
//
//*****************************************************************************
// Field:  [31:0] CYCCNT
//
// Increments one on each processor clock cycle when DWT_CTRL.CYCCNTENA == 1
// and DEMCR.TRCENA == 1. On overflow, CYCCNT wraps to zero
#define CPU_DWT_CYCCNT_CYCCNT_W                                             32
#define CPU_DWT_CYCCNT_CYCCNT_M                                     0xFFFFFFFF
#define CPU_DWT_CYCCNT_CYCCNT_S                                              0

//*****************************************************************************
//
// Register: CPU_DWT_O_CPICNT
//
//*****************************************************************************
// Field:   [7:0] CPICNT
//
// Counts one on each cycle when all of the following are true:
// - DWT_CTRL.CPIEVTENA == 1 and DEMCR.TRCENA == 1.
// - No instruction is executed.
// - No load-store operation is in progress, see DWT_LSUCNT.
// - No exception-entry or exception-exit operation is in progress, see
// DWT_EXCCNT.
// - The PE is not in a power saving mode, see DWT_SLEEPCNT.
// - Either SecureNoninvasiveDebugAllowed() == TRUE, or the PE is in Non-secure
// state and NoninvasiveDebugAllowed() == TRUE.
#define CPU_DWT_CPICNT_CPICNT_W                                              8
#define CPU_DWT_CPICNT_CPICNT_M                                     0x000000FF
#define CPU_DWT_CPICNT_CPICNT_S                                              0

//*****************************************************************************
//
// Register: CPU_DWT_O_EXCCNT
//
//*****************************************************************************
// Field:   [7:0] EXCCNT
//
// Counts one on each cycle when all of the following are true:
//  - DWT_CTRL.EXCEVTENA == 1 and DEMCR.TRCENA == 1.
//  - No instruction is executed, see DWT_CPICNT.
//  - An exception-entry or exception-exit related operation is in progress.
//  - Either SecureNoninvasiveDebugAllowed() == TRUE, or NS-Req for the
// operation is set to Non-secure and NoninvasiveDebugAllowed() == TRUE.
#define CPU_DWT_EXCCNT_EXCCNT_W                                              8
#define CPU_DWT_EXCCNT_EXCCNT_M                                     0x000000FF
#define CPU_DWT_EXCCNT_EXCCNT_S                                              0

//*****************************************************************************
//
// Register: CPU_DWT_O_SLEEPCNT
//
//*****************************************************************************
// Field:   [7:0] SLEEPCNT
//
// Counts one on each cycle when all of the following are true:
// - DWT_CTRL.SLEEPEVTENA == 1 and DEMCR.TRCENA == 1.
// - No instruction is executed, see DWT_CPICNT.
// - No load-store operation is in progress, see DWT_LSUCNT.
// - No exception-entry or exception-exit operation is in progress, see
// DWT_EXCCNT.
// - The PE is in a power saving mode.
// - Either SecureNoninvasiveDebugAllowed() == TRUE, or the PE is in Non-secure
// state and NoninvasiveDebugAllowed() == TRUE.
#define CPU_DWT_SLEEPCNT_SLEEPCNT_W                                          8
#define CPU_DWT_SLEEPCNT_SLEEPCNT_M                                 0x000000FF
#define CPU_DWT_SLEEPCNT_SLEEPCNT_S                                          0

//*****************************************************************************
//
// Register: CPU_DWT_O_LSUCNT
//
//*****************************************************************************
// Field:   [7:0] LSUCNT
//
// Counts one on each cycle when all of the following are true:
//  - DWT_CTRL.LSUEVTENA == 1 and DEMCR.TRCENA == 1.
//  - No instruction is executed, see DWT_CPICNT.
//  - No exception-entry or exception-exit operation is in progress, see
// DWT_EXCCNT.
//  - A load-store operation is in progress.
//  - Either SecureNoninvasiveDebugAllowed() == TRUE, or NS-Req for the
// operation is set to Non-secure and NoninvasiveDebugAllowed() == TRUE.
#define CPU_DWT_LSUCNT_LSUCNT_W                                              8
#define CPU_DWT_LSUCNT_LSUCNT_M                                     0x000000FF
#define CPU_DWT_LSUCNT_LSUCNT_S                                              0

//*****************************************************************************
//
// Register: CPU_DWT_O_FOLDCNT
//
//*****************************************************************************
// Field:   [7:0] FOLDCNT
//
// Counts on each cycle when all of the following are true:
//  - DWT_CTRL.FOLDEVTENA == 1 and DEMCR.TRCENA == 1.
//  - At least two instructions are executed, see DWT_CPICNT.
//  - Either SecureNoninvasiveDebugAllowed() == TRUE, or the PE is in
// Non-secure state and NoninvasiveDebugAllowed() == TRUE.
//  The counter is incremented by the number of instructions executed, minus
// one
#define CPU_DWT_FOLDCNT_FOLDCNT_W                                            8
#define CPU_DWT_FOLDCNT_FOLDCNT_M                                   0x000000FF
#define CPU_DWT_FOLDCNT_FOLDCNT_S                                            0

//*****************************************************************************
//
// Register: CPU_DWT_O_PCSR
//
//*****************************************************************************
// Field:  [31:0] EIASAMPLE
//
// The possible values of this field are:
// 0xFFFFFFFF
//   One of the following is true:
//   - The PE is halted in Debug state.
//   - The Security Extension is implemented, the sampled instruction was
// executed in Secure state, and SecureNoninvasiveDebugAllowed() == FALSE.
//   - NoninvasiveDebugAllowed() == FALSE.
//   - DEMCR.TRCENA == 0.
//   - The address of a recently-executed instruction is not available.
// Not 0xFFFFFFFF
//   Instruction address of a recently executed instruction. Bit [0] of the
// sample instruction address is 0.
#define CPU_DWT_PCSR_EIASAMPLE_W                                            32
#define CPU_DWT_PCSR_EIASAMPLE_M                                    0xFFFFFFFF
#define CPU_DWT_PCSR_EIASAMPLE_S                                             0

//*****************************************************************************
//
// Register: CPU_DWT_O_COMP0
//
//*****************************************************************************
//*****************************************************************************
//
// Register: CPU_DWT_O_FUNCTION0
//
//*****************************************************************************
// Field: [31:27] ID
//
// Identifies the capabilities for MATCH for comparator *n
#define CPU_DWT_FUNCTION0_ID_W                                               5
#define CPU_DWT_FUNCTION0_ID_M                                      0xF8000000
#define CPU_DWT_FUNCTION0_ID_S                                              27

// Field:    [24] MATCHED
//
// Set to 1 when the comparator matches
#define CPU_DWT_FUNCTION0_MATCHED                                   0x01000000
#define CPU_DWT_FUNCTION0_MATCHED_BITN                                      24
#define CPU_DWT_FUNCTION0_MATCHED_M                                 0x01000000
#define CPU_DWT_FUNCTION0_MATCHED_S                                         24

// Field: [11:10] DATAVSIZE
//
// Defines the size of the object being watched for by Data Value and Data
// Address comparators
#define CPU_DWT_FUNCTION0_DATAVSIZE_W                                        2
#define CPU_DWT_FUNCTION0_DATAVSIZE_M                               0x00000C00
#define CPU_DWT_FUNCTION0_DATAVSIZE_S                                       10

