espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_dwt.h
// Field:   [5:4] ACTION
//
// Defines the action on a match. This field is ignored and the comparator
// generates no actions if it is disabled by MATCH
#define CPU_DWT_FUNCTION0_ACTION_W                                           2
#define CPU_DWT_FUNCTION0_ACTION_M                                  0x00000030
#define CPU_DWT_FUNCTION0_ACTION_S                                           4

// Field:   [3:0] MATCH
//
// Controls the type of match generated by this comparator
#define CPU_DWT_FUNCTION0_MATCH_W                                            4
#define CPU_DWT_FUNCTION0_MATCH_M                                   0x0000000F
#define CPU_DWT_FUNCTION0_MATCH_S                                            0

//*****************************************************************************
//
// Register: CPU_DWT_O_COMP1
//
//*****************************************************************************
//*****************************************************************************
//
// Register: CPU_DWT_O_FUNCTION1
//
//*****************************************************************************
// Field: [31:27] ID
//
// Identifies the capabilities for MATCH for comparator *n
#define CPU_DWT_FUNCTION1_ID_W                                               5
#define CPU_DWT_FUNCTION1_ID_M                                      0xF8000000
#define CPU_DWT_FUNCTION1_ID_S                                              27

// Field:    [24] MATCHED
//
// Set to 1 when the comparator matches
#define CPU_DWT_FUNCTION1_MATCHED                                   0x01000000
#define CPU_DWT_FUNCTION1_MATCHED_BITN                                      24
#define CPU_DWT_FUNCTION1_MATCHED_M                                 0x01000000
#define CPU_DWT_FUNCTION1_MATCHED_S                                         24

// Field: [11:10] DATAVSIZE
//
// Defines the size of the object being watched for by Data Value and Data
// Address comparators
#define CPU_DWT_FUNCTION1_DATAVSIZE_W                                        2
#define CPU_DWT_FUNCTION1_DATAVSIZE_M                               0x00000C00
#define CPU_DWT_FUNCTION1_DATAVSIZE_S                                       10

// Field:   [5:4] ACTION
//
// Defines the action on a match. This field is ignored and the comparator
// generates no actions if it is disabled by MATCH
#define CPU_DWT_FUNCTION1_ACTION_W                                           2
#define CPU_DWT_FUNCTION1_ACTION_M                                  0x00000030
#define CPU_DWT_FUNCTION1_ACTION_S                                           4

// Field:   [3:0] MATCH
//
// Controls the type of match generated by this comparator
#define CPU_DWT_FUNCTION1_MATCH_W                                            4
#define CPU_DWT_FUNCTION1_MATCH_M                                   0x0000000F
#define CPU_DWT_FUNCTION1_MATCH_S                                            0

//*****************************************************************************
//
// Register: CPU_DWT_O_COMP2
//
//*****************************************************************************
//*****************************************************************************
//
// Register: CPU_DWT_O_FUNCTION2
//
//*****************************************************************************
// Field: [31:27] ID
//
// Identifies the capabilities for MATCH for comparator *n
#define CPU_DWT_FUNCTION2_ID_W                                               5
#define CPU_DWT_FUNCTION2_ID_M                                      0xF8000000
#define CPU_DWT_FUNCTION2_ID_S                                              27

// Field:    [24] MATCHED
//
// Set to 1 when the comparator matches
#define CPU_DWT_FUNCTION2_MATCHED                                   0x01000000
#define CPU_DWT_FUNCTION2_MATCHED_BITN                                      24
#define CPU_DWT_FUNCTION2_MATCHED_M                                 0x01000000
#define CPU_DWT_FUNCTION2_MATCHED_S                                         24

// Field: [11:10] DATAVSIZE
//
// Defines the size of the object being watched for by Data Value and Data
// Address comparators
#define CPU_DWT_FUNCTION2_DATAVSIZE_W                                        2
#define CPU_DWT_FUNCTION2_DATAVSIZE_M                               0x00000C00
#define CPU_DWT_FUNCTION2_DATAVSIZE_S                                       10

// Field:   [5:4] ACTION
//
// Defines the action on a match. This field is ignored and the comparator
// generates no actions if it is disabled by MATCH
#define CPU_DWT_FUNCTION2_ACTION_W                                           2
#define CPU_DWT_FUNCTION2_ACTION_M                                  0x00000030
#define CPU_DWT_FUNCTION2_ACTION_S                                           4

// Field:   [3:0] MATCH
//
// Controls the type of match generated by this comparator
#define CPU_DWT_FUNCTION2_MATCH_W                                            4
#define CPU_DWT_FUNCTION2_MATCH_M                                   0x0000000F
#define CPU_DWT_FUNCTION2_MATCH_S                                            0

//*****************************************************************************
//
// Register: CPU_DWT_O_COMP3
//
//*****************************************************************************
//*****************************************************************************
//
// Register: CPU_DWT_O_FUNCTION3
//
//*****************************************************************************
// Field: [31:27] ID
//
// Identifies the capabilities for MATCH for comparator *n
#define CPU_DWT_FUNCTION3_ID_W                                               5
#define CPU_DWT_FUNCTION3_ID_M                                      0xF8000000
#define CPU_DWT_FUNCTION3_ID_S                                              27

// Field:    [24] MATCHED
//
// Set to 1 when the comparator matches
#define CPU_DWT_FUNCTION3_MATCHED                                   0x01000000
#define CPU_DWT_FUNCTION3_MATCHED_BITN                                      24
#define CPU_DWT_FUNCTION3_MATCHED_M                                 0x01000000
#define CPU_DWT_FUNCTION3_MATCHED_S                                         24

// Field: [11:10] DATAVSIZE
//
// Defines the size of the object being watched for by Data Value and Data
// Address comparators
#define CPU_DWT_FUNCTION3_DATAVSIZE_W                                        2
#define CPU_DWT_FUNCTION3_DATAVSIZE_M                               0x00000C00
#define CPU_DWT_FUNCTION3_DATAVSIZE_S                                       10

