espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_dwt.h
// Field:   [5:4] ACTION
//
// Defines the action on a match. This field is ignored and the comparator
// generates no actions if it is disabled by MATCH
#define CPU_DWT_FUNCTION3_ACTION_W                                           2
#define CPU_DWT_FUNCTION3_ACTION_M                                  0x00000030
#define CPU_DWT_FUNCTION3_ACTION_S                                           4

// Field:   [3:0] MATCH
//
// Controls the type of match generated by this comparator
#define CPU_DWT_FUNCTION3_MATCH_W                                            4
#define CPU_DWT_FUNCTION3_MATCH_M                                   0x0000000F
#define CPU_DWT_FUNCTION3_MATCH_S                                            0

//*****************************************************************************
//
// Register: CPU_DWT_O_DEVARCH
//
//*****************************************************************************
// Field: [31:21] ARCHITECT
//
// Defines the architect of the component. Bits [31:28] are the JEP106
// continuation code (JEP106 bank ID, minus 1) and bits [27:21] are the JEP106
// ID code.
#define CPU_DWT_DEVARCH_ARCHITECT_W                                         11
#define CPU_DWT_DEVARCH_ARCHITECT_M                                 0xFFE00000
#define CPU_DWT_DEVARCH_ARCHITECT_S                                         21

// Field:    [20] PRESENT
//
// Defines that the DEVARCH register is present
#define CPU_DWT_DEVARCH_PRESENT                                     0x00100000
#define CPU_DWT_DEVARCH_PRESENT_BITN                                        20
#define CPU_DWT_DEVARCH_PRESENT_M                                   0x00100000
#define CPU_DWT_DEVARCH_PRESENT_S                                           20

// Field: [19:16] REVISION
//
// Defines the architecture revision of the component
#define CPU_DWT_DEVARCH_REVISION_W                                           4
#define CPU_DWT_DEVARCH_REVISION_M                                  0x000F0000
#define CPU_DWT_DEVARCH_REVISION_S                                          16

// Field: [15:12] ARCHVER
//
// Defines the architecture version of the component
#define CPU_DWT_DEVARCH_ARCHVER_W                                            4
#define CPU_DWT_DEVARCH_ARCHVER_M                                   0x0000F000
#define CPU_DWT_DEVARCH_ARCHVER_S                                           12

// Field:  [11:0] ARCHPART
//
// Defines the architecture of the component
#define CPU_DWT_DEVARCH_ARCHPART_W                                          12
#define CPU_DWT_DEVARCH_ARCHPART_M                                  0x00000FFF
#define CPU_DWT_DEVARCH_ARCHPART_S                                           0

//*****************************************************************************
//
// Register: CPU_DWT_O_DEVTYPE
//
//*****************************************************************************
// Field:   [7:4] SUB
//
// Component sub-type
#define CPU_DWT_DEVTYPE_SUB_W                                                4
#define CPU_DWT_DEVTYPE_SUB_M                                       0x000000F0
#define CPU_DWT_DEVTYPE_SUB_S                                                4

// Field:   [3:0] MAJOR
//
// Component major type
#define CPU_DWT_DEVTYPE_MAJOR_W                                              4
#define CPU_DWT_DEVTYPE_MAJOR_M                                     0x0000000F
#define CPU_DWT_DEVTYPE_MAJOR_S                                              0

//*****************************************************************************
//
// Register: CPU_DWT_O_PIDR4
//
//*****************************************************************************
// Field:   [7:4] SIZE
//
// See CoreSight Architecture Specification
#define CPU_DWT_PIDR4_SIZE_W                                                 4
#define CPU_DWT_PIDR4_SIZE_M                                        0x000000F0
#define CPU_DWT_PIDR4_SIZE_S                                                 4

// Field:   [3:0] DES_2
//
// See CoreSight Architecture Specification
#define CPU_DWT_PIDR4_DES_2_W                                                4
#define CPU_DWT_PIDR4_DES_2_M                                       0x0000000F
#define CPU_DWT_PIDR4_DES_2_S                                                0

//*****************************************************************************
//
// Register: CPU_DWT_O_PIDR5
//
//*****************************************************************************
//*****************************************************************************
//
// Register: CPU_DWT_O_PIDR6
//
//*****************************************************************************
//*****************************************************************************
//
// Register: CPU_DWT_O_PIDR7
//
//*****************************************************************************
//*****************************************************************************
//
// Register: CPU_DWT_O_PIDR0
//
//*****************************************************************************
// Field:   [7:0] PART_0
//
// See CoreSight Architecture Specification
#define CPU_DWT_PIDR0_PART_0_W                                               8
#define CPU_DWT_PIDR0_PART_0_M                                      0x000000FF
#define CPU_DWT_PIDR0_PART_0_S                                               0

//*****************************************************************************
//
// Register: CPU_DWT_O_PIDR1
//
//*****************************************************************************
// Field:   [7:4] DES_0
//
// See CoreSight Architecture Specification
#define CPU_DWT_PIDR1_DES_0_W                                                4
#define CPU_DWT_PIDR1_DES_0_M                                       0x000000F0
#define CPU_DWT_PIDR1_DES_0_S                                                4

// Field:   [3:0] PART_1
//
// See CoreSight Architecture Specification
#define CPU_DWT_PIDR1_PART_1_W                                               4
#define CPU_DWT_PIDR1_PART_1_M                                      0x0000000F
#define CPU_DWT_PIDR1_PART_1_S                                               0

//*****************************************************************************
//
// Register: CPU_DWT_O_PIDR2
//
//*****************************************************************************
// Field:   [7:4] REVISION
//
// See CoreSight Architecture Specification
#define CPU_DWT_PIDR2_REVISION_W                                             4
#define CPU_DWT_PIDR2_REVISION_M                                    0x000000F0
#define CPU_DWT_PIDR2_REVISION_S                                             4

// Field:     [3] JEDEC
//
// See CoreSight Architecture Specification
#define CPU_DWT_PIDR2_JEDEC                                         0x00000008
#define CPU_DWT_PIDR2_JEDEC_BITN                                             3
#define CPU_DWT_PIDR2_JEDEC_M                                       0x00000008
#define CPU_DWT_PIDR2_JEDEC_S                                                3

