espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_dwt.h
// Field:   [2:0] DES_1
//
// See CoreSight Architecture Specification
#define CPU_DWT_PIDR2_DES_1_W                                                3
#define CPU_DWT_PIDR2_DES_1_M                                       0x00000007
#define CPU_DWT_PIDR2_DES_1_S                                                0

//*****************************************************************************
//
// Register: CPU_DWT_O_PIDR3
//
//*****************************************************************************
// Field:   [7:4] REVAND
//
// See CoreSight Architecture Specification
#define CPU_DWT_PIDR3_REVAND_W                                               4
#define CPU_DWT_PIDR3_REVAND_M                                      0x000000F0
#define CPU_DWT_PIDR3_REVAND_S                                               4

// Field:   [3:0] CMOD
//
// See CoreSight Architecture Specification
#define CPU_DWT_PIDR3_CMOD_W                                                 4
#define CPU_DWT_PIDR3_CMOD_M                                        0x0000000F
#define CPU_DWT_PIDR3_CMOD_S                                                 0

//*****************************************************************************
//
// Register: CPU_DWT_O_CIDR0
//
//*****************************************************************************
// Field:   [7:0] PRMBL_0
//
// See CoreSight Architecture Specification
#define CPU_DWT_CIDR0_PRMBL_0_W                                              8
#define CPU_DWT_CIDR0_PRMBL_0_M                                     0x000000FF
#define CPU_DWT_CIDR0_PRMBL_0_S                                              0

//*****************************************************************************
//
// Register: CPU_DWT_O_CIDR1
//
//*****************************************************************************
// Field:   [7:4] CLASS
//
// See CoreSight Architecture Specification
#define CPU_DWT_CIDR1_CLASS_W                                                4
#define CPU_DWT_CIDR1_CLASS_M                                       0x000000F0
#define CPU_DWT_CIDR1_CLASS_S                                                4

// Field:   [3:0] PRMBL_1
//
// See CoreSight Architecture Specification
#define CPU_DWT_CIDR1_PRMBL_1_W                                              4
#define CPU_DWT_CIDR1_PRMBL_1_M                                     0x0000000F
#define CPU_DWT_CIDR1_PRMBL_1_S                                              0

//*****************************************************************************
//
// Register: CPU_DWT_O_CIDR2
//
//*****************************************************************************
// Field:   [7:0] PRMBL_2
//
// See CoreSight Architecture Specification
#define CPU_DWT_CIDR2_PRMBL_2_W                                              8
#define CPU_DWT_CIDR2_PRMBL_2_M                                     0x000000FF
#define CPU_DWT_CIDR2_PRMBL_2_S                                              0

//*****************************************************************************
//
// Register: CPU_DWT_O_CIDR3
//
//*****************************************************************************
// Field:   [7:0] PRMBL_3
//
// See CoreSight Architecture Specification
#define CPU_DWT_CIDR3_PRMBL_3_W                                              8
#define CPU_DWT_CIDR3_PRMBL_3_M                                     0x000000FF
#define CPU_DWT_CIDR3_PRMBL_3_S                                              0


#endif // __CPU_DWT__
